src/BusinessProcesses/РаспределениеЗаявкиФСВТС/РаспределениеЗаявкиФСВТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>РаспределениеЗаявкиФСВТС</name>
  <task>Task.ЗадачаИсполнителя</task>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <comment>Фактическая дата завершения бизнес-процесса</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <comment>Описание задания</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегиональныйРуководитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Эксперт</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаФСВТС</types>
    </type>
  </attributes>
  <attributes>
    <name>РаспределениеСогласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПредметыСнабжения</name>
    <attributes>
      <name>КодПС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбозначениеПС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредметСнабжения</name>
      <type>
        <types>CatalogRef.НеиденитифицированныеПредметыСнабжения</types>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>КодИзделия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеИзделия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.СтруктураЗаказаПоКомплектующимИзделиямИЗИП</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеИерархииИзделия</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:BusinessProcess>

src/Documents/РаспределениеЗаявки/РаспределениеЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РаспределениеЗаявки</name>
  <registerRecords>AccumulationRegister.РаспределениеЗаявок</registerRecords>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаФСВТС</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПредметыСнабжения</name>
    <attributes>
      <name>ПредметСнабжения</name>
      <type>
        <types>CatalogRef.НеиденитифицированныеПредметыСнабжения</types>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/Заявка/Заявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заявка</name>
  <comment>Заявки на поставку предметов снабжения</comment>
  <posting>Deny</posting>
  <attributes>
    <name>НомерЗаказчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииЗаявокНаПоставкуПС</types>
    </type>
  </attributes>
  <attributes>
    <name>Корабли</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПозиций</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РуководительПроектаВТС</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСуммаЗаявки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.ОКВ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНазначенияДЗО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсполнительДЗО</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагруженаССайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТекущийЭтап</name>
    <type>
      <types>CatalogRef.ЭтапыВыполненияЗаявокНаПоставкуПредметовСнабжения</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДатаТекущегоЭтапа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросТКПRFP</name>
    <type>
      <types>DocumentRef.ЗапросТКПRFP</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпециалистДЭ</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Удалить_ЭтапыВыполненияЗаявки</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.ЭтапыВыполненияЗаявокНаПоставкуПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Спецификация</name>
    <attributes>
      <name>ИдентификаторПозиции</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредметСнабжения</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.СтруктураЗаказаПоКомплектующимИзделиямИЗИП</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПредметаСнабженияЗаказчика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодПредметаСнабженияЗаказчика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеИзделияЗаказчика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсполнительДЗО</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаОСК</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеИерархииИзделия</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийЭтап</name>
      <type>
        <types>CatalogRef.ЭтапыВыполненияПунктовЗаявок</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаТекущегоЭтапа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаТекущегоГода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСледующегоГода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаГодаЧерез1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникЦеновойИнформации</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбоснованиеЦенообразования</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредметСнабженияИсходный</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыВыполненияСпецификации</name>
    <attributes>
      <name>ИдентификаторПозиции</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.ЭтапыВыполненияПунктовЗаявок</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Проекты</name>
    <attributes>
      <name>Корабль</name>
      <type>
        <types>CatalogRef.ПроектыКораблей</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/BusinessProcesses/РаспределениеЗаявкиФСВТС/Forms/ФормаРедактированияРаспределения/Module.bsl
/////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция ПолучитьМассив(Таблица, ИмяКолонки)
	ВременнаяТаблица = Таблица.Скопировать();
	ВременнаяТаблица.Свернуть(ИмяКолонки);
	Возврат ВременнаяТаблица.ВыгрузитьКолонку(ИмяКолонки);
КонецФункции // ПолучитьМассив

&НаСервере
Процедура СоздатьДокументы(ТаблицаОбработки)
	НачатьТранзакцию();
	Попытка
		Для Каждого Организация Из ПолучитьМассив(ТаблицаОбработки, "Организация") Цикл
			Документ 				= Документы.РаспределениеЗаявки.СоздатьДокумент();
			Документ.Дата 			= ТекущаяДата();
			Документ.Исполнитель 	= Организация;
			Документ.Заявка 		= Объект.Предмет;
			Документ.ПредметыСнабжения.Загрузить(ТаблицаОбработки.Скопировать(Новый Структура("Организация", Организация)));
			Для Каждого Строка Из Документ.ПредметыСнабжения Цикл
				Строка.Количество 	= -1 * Строка.Количество;
			КонецЦикла; // Для Каждого Строка Из Документ.ПредметыСнабжения Цикл			
			Документ.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла; // Для Каждого Организация Из ПолучитьМассив(ТаблицаОбработки, "Организация") Цикл
		
		Для Каждого Организация Из ПолучитьМассив(ТаблицаОбработки, "ОрганизацияНовая") Цикл
			Документ 				= Документы.РаспределениеЗаявки.СоздатьДокумент();
			Документ.Дата 			= ТекущаяДата();
			Документ.Исполнитель 	= Организация;
			Документ.Заявка 		= Объект.Предмет;
			Документ.ПредметыСнабжения.Загрузить(ТаблицаОбработки.Скопировать(Новый Структура("ОрганизацияНовая", Организация)));
			Документ.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла; // Для Каждого Организация Из ПолучитьМассив(ТаблицаОбработки, "Организация") Цикл
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось изменить распределение: " + ОписаниеОшибки());
	КонецПопытки;
	
	
КонецПроцедуры // СоздатьДокументы

&НаСервере
Функция ПодготовитьТаблицуОбработки()
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ПредметСнабжения");
	Результат.Колонки.Добавить("Количество");
	Результат.Колонки.Добавить("Организация");
	Результат.Колонки.Добавить("ОрганизацияНовая");
	Возврат Результат;
КонецФункции // ПодготовитьТаблицуОбработки

&НаСервере
Процедура ВыполнитьЗаменуОрганизации(Организация, ИзменяемыеСтроки = Неопределено)
	Запрос 				= Новый Запрос;
	Запрос.Текст 		= ТаблицаРаспределения.ТекстЗапроса;
	Запрос.УстановитьПараметр("Заявка", Объект.Предмет);
	ТаблицаДанных 		= Запрос.Выполнить().Выгрузить();
	ТаблицаОбработки	= ПодготовитьТаблицуОбработки();
	// Соберем таблицу для обработки
	Для Каждого Строка Из ТаблицаДанных Цикл
		Если Строка.Организация = Организация Тогда
			Продолжить;
		КонецЕсли; // Если Строка.Органиазация = Организация Тогда
		
		Если Не ИзменяемыеСтроки = Неопределено 
			И ИзменяемыеСтроки.Найти(Строка.НомерСтроки) = Неопределено Тогда
			Продолжить;
		КонецЕсли; // Если Не ИзменяемыеСтроки = Неопределено Тогда		
		
		НоваяСтрока 					= ТаблицаОбработки.Добавить();
		НоваяСтрока.ПредметСнабжения 	= Строка.ПредметСнабжения;
		НоваяСтрока.Количество 			= Строка.Количество;
		НоваяСтрока.Организация 		= Строка.Организация;
		НоваяСтрока.ОрганизацияНовая 	= Организация;
	КонецЦикла; // Для Каждого Строка Из ТаблицаДанных Цикл
	
	// Создадим документы
	Если ТаблицаОбработки.Количество() > 0 Тогда
		СоздатьДокументы(ТаблицаОбработки);
	КонецЕсли; // Если ТаблицаОбработки.Количество() > 0 Тогда
	
КонецПроцедуры // ВыполнитьЗаменуОрганизации

&НаКлиенте
Процедура ПослеПодтвержденияОрганизации(Результат, ДополнительныеПараметры) Экспорт
	Если Не Результат = КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли; // Если Не Результат = КодВозвратаДиалога.ОК Тогда
	
	Если Не ДополнительныеПараметры.Свойство("Организация") Тогда
		Возврат;
	КонецЕсли; // Если Не ДополнительныеПараметры.Свойство("Организация") Тогда
	
	Если ДополнительныеПараметры.Свойство("ВыделенныеСтроки") Тогда
		ИзменяемыеСтроки = Новый Массив;
		Для Каждого Идентификатор Из ДополнительныеПараметры.ВыделенныеСтроки Цикл
			Строка = Элементы.ТаблицаРаспределения.ДанныеСтроки(Идентификатор);
			Если Не Строка = Неопределено Тогда
				ИзменяемыеСтроки.Добавить(Строка.НомерСтроки);
			КонецЕсли; // Если Не Строка = Неопределено Тогда			
		КонецЦикла; // Для Каждого Идентификатор Из ДополнительныеПараметры.ВыделенныеСтроки Цикл		
		ВыполнитьЗаменуОрганизации(Организация, ИзменяемыеСтроки);
	Иначе
		ВыполнитьЗаменуОрганизации(Организация);
	КонецЕсли; // Если ДополнительныеПараметры.Свойство("ВыделенныеСтроки") Тогда
	Элементы.ТаблицаРаспределения.Обновить();
КонецПроцедуры // ПослеПодтвержденияОрганизации

/////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
Процедура КомандаПоказатьВложения(Команда)
	ПараметрыФормы 	= Новый Структура;
	ПараметрыФормы.Вставить("ВладелецФайла", 	Объект.Предмет);	
	ПараметрыФормы.Вставить("ТолькоПросмотр", 	Истина);	
	ОткрытьФорму("ОбщаяФорма.ПрисоединенныеФайлы", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры // КомандаПоказатьВложения

&НаКлиенте
Процедура КомандаУстановитьДляВсех(Команда)
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена организация!",,,"Организация");
		Возврат;
	КонецЕсли; // Если Не ЗначениеЗаполнено(Организация) Тогда
	
	ДополнительныеПараметры = Новый Структура("Организация", Организация);
	ОписаниеОповещения 		= Новый ОписаниеОповещения("ПослеПодтвержденияОрганизации", ЭтаФорма, ДополнительныеПараметры);
	ПоказатьВопрос(ОписаниеОповещения, 
					"Установить выбранную организацию для всех строк?",
					РежимДиалогаВопрос.ОКОтмена,
					30, 
					КодВозвратаДиалога.Отмена, 
					"Внимание", 
					КодВозвратаДиалога.Отмена);
КонецПроцедуры // КомандаУстановитьДляВсех

&НаКлиенте
Процедура КомандаУстановитьДляВыбранных(Команда)
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена организация!",,,"Организация");
		Возврат;                  
	КонецЕсли; // Если Не ЗначениеЗаполнено(Организация) Тогда
	
	ВыделенныеСтроки = Элементы.ТаблицаРаспределения.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбрано ни одной строки!",,,"ТаблицаРаспределения");
		Возврат;
	КонецЕсли; // Если ВыделенныеСтроки.Количество() = 0 Тогда
	
	ДополнительныеПараметры = Новый Структура("Организация, ВыделенныеСтроки", Организация, ВыделенныеСтроки);
	ОписаниеОповещения 		= Новый ОписаниеОповещения("ПослеПодтвержденияОрганизации", ЭтаФорма, ДополнительныеПараметры);
	ПоказатьВопрос(ОписаниеОповещения, 
					"Установить выбранную организацию для выбранных строк?",
					РежимДиалогаВопрос.ОКОтмена,
					30, 
					КодВозвратаДиалога.Отмена, 
					"Внимание", 
					КодВозвратаДиалога.Отмена);
КонецПроцедуры // КомандаУстановитьДляВыбранных

/////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИсторияСогласования 						= Документы.ЗаявкаФСВТС.СформироватьТабличныйДокументИсторииСогласования(Объект.БизнесПроцесс);
	Элементы.КомандаПоказатьВложения.Заголовок 	= Справочники.ЗаявкаФСВТСПрисоединенныеФайлы.ПолучитьКоличество(Объект.Предмет);
	ТаблицаРаспределения.Параметры.УстановитьЗначениеПараметра("Заявка", Объект.Предмет);
КонецПроцедуры // ПриСозданииНаСервере
